tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Vector graphics library with cross-device output support
brew "cairo"
# C unit testing framework
brew "check"
# Command-line tool to interact with exercism.io
brew "exercism"
# GNU compiler collection
brew "gcc@7"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Platform built on V8 to build network applications
brew "node", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Build tool for Scala projects
brew "sbt"
# User interface to the TELNET protocol
brew "telnet"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8"
